reflection-1-project-profile.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-05-06 Thu 13:51 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Reflection 01: DH Project Profile</title>
<meta name="author" content="Matt Price" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<article id="content">
<header>
<h1 class="title">Reflection 01: DH Project Profile</h1>
</header><p>
Your first assignment is to profile a Digital Humanities project, analyzing its research aims, its form and content, its interface, technologies, and intended audience. You will learn how to navigate Digital Humanities projects, how to identify and evaluate different aspects of such projects, and how to analyze the kinds of knowledge and digital artifacts    generated by DH projects. <b>Write-up: 800 words plus screenshots</b>.
</p>

<p>
You may select any project you like from the syllabus or from one of the pages below, with the caveat that <b>the project should be identifiably humanistic</b> in orientation. You should be able to articulate the aims of the project in ways that reflect <b>your existing understanding of what the humanities are</b>. 
</p>

<ul class="org-ul">
<li><a href="https://eadh.org/projects">European Association for Digital Humanities</a> (please start here)</li>
<li><a href="https://digitalhumanities.duke.edu/all-projects">Duke University DH Index</a></li>
<li><a href="https://www.ryerson.ca/cdh/projects/">Ryerson University DH Projects</a></li>
<li><a href="https://dhn.utoronto.ca/projects/">U of T DH Network</a></li>
<li><a href="https://cdh.unc.edu/prsp-template/proj_init/">UNC DH Lab</a></li>
<li><a href="https://docs.google.com/document/d/1kp9VURhHnxVvaG2D2l7sBS_mQcSOZZ03s2Lr7Intpr0/edit#heading=h.dj72fsf219b9">Queer DH Index</a></li>
<li><a href="https://libguides.sdsu.edu/digitalhumanities/projects">SDSU Listings</a> (some are indices, but some interesting projects here also)</li>
<li><a href="https://docs.google.com/document/d/1rZwucjyAAR7QiEZl238_hhRPXo5-UKXt2_KCrwPZkiQ/edit#">Black DH</a></li>
</ul>

<p>
This project profile is not an essay; it is a short, 2-3 page report. You do not need to write a formal introduction, thesis, argument, or conclusion. You should only report on your observations, using the questions below as categories of analysis, each with its own heading. Not all categories and questions apply to all projects, so <b>do not feel obligated to respond to all of them</b>. Your project profile will be evaluated for <a href="http://www.artsci.utoronto.ca/newstudents/transition/academic/grading">accuracy, clarity, detail, quality of analysis, and insight</a>.
</p>


<ol class="org-ol">
<li><b>Project:</b> What is the name of the project? Who are its primary authors? Be sure to include one or more links in the first paragraph of your assignment, so we can navigate quickly to the project itself.</li>

<li><b>Topic and Significance for the Humanities:</b> What is the project about? (Examples: What topic and historical period does it focus on? What texts or art works or other material does it collect, explain, map, or analyze? What questions is the project seeking to answer?)</li>

<li><b>People &amp; Institutions</b>: Who is the project leader? Who are their collaborators? What is the institution involved in the project&rsquo;s development? What are the granting bodies funding the projects? Is credit given to individual contributors? To what extent?</li>

<li><p>
<b>Presentation &amp; User Experience:</b> What is the “digital artifact” through which this project communicates its findings? A book? A game? A map? An edition? An archive? A tool? Another type of digital artifact?
</p>

<p>
As a user external to the project, what steps did you take to explore the project? Can you understand how to read the project&rsquo;s data or how to use the tools it is building? As you explore the project, what do you find easy? What do you find difficult? What do you like? What do you dislike? Document your experience with screenshots, please (<a href="https://screenshots.firefox.com/">firefox&rsquo;s screenshot tool</a> makes this very easy).
</p>

<p>
Does this project provide access to users with e.g. limited bandwidth, minimal computing (e.g. smartphones instead of laptops), vision or hearing or tactile impairment?
</p></li>

<li><b>Data:</b>  What data does the project generate? What data format(s): text files, pdf files, digital images, databases, Excel or .csv files? Does the project provide narrative context for its data (that is, does it clearly explain what its data means and why it matters, for readers not familiar with the project)? Is access to project data open, subscription-only, or under a specific licence? May other scholars download the project&rsquo;s data?</li>

<li><b>Technologies:</b> What technologies (encoding formats, digital publication platforms, software) are used in this project or built as part of this project? Are these technologies open-source, open-access?</li>

<li><b>Audience:</b> Who is the intended audience for this project? That is, does this project primarily speak to laypeople? Scholars? Specialists? How can you tell?</li>

<li><b>Limitations:</b> Does the project make note of any limitations in its work, any gaps or uncertainties in its data? Can you find limitations in its work&#x2014;that is, gaps between its stated goals and its results?</li>
</ol>

<p>
This assignment is based on the <a href="https://dmptool.org/">DMP Tool</a>, the U of T DH Census Profile tool, and <a href="https://docs.google.com/document/d/1jp0bQ18hXKxekgACfBCw_6P6lO_xg4uzUXXMvT2jaPo/edit">Kristen Mapes</a>&rsquo; DH Project Critique assignment.
</p>

<nil id="outline-container-org9d7f696" class="outline-2">
<h2 id="org9d7f696">Rubric&#xa0;&#xa0;&#xa0;<span class="tag"><span class="rubric">rubric</span></span></h2>
<div class="outline-text-2" id="text-org9d7f696">
<p>
Components (check/no-check)
</p>
<ul class="org-ul">
<li class="off"><input type='checkbox' /> topic</li>
<li class="off"><input type='checkbox' /> people + institutions</li>
<li class="off"><input type='checkbox' /> presentation + UX</li>
<li class="off"><input type='checkbox' /> data</li>
<li class="off"><input type='checkbox' /> technologies</li>
<li class="off"><input type='checkbox' /> audience</li>
<li class="off"><input type='checkbox' /> limitations</li>
</ul>


<dl class="org-dl">
<dt><b>Grade</b></dt><dd></dd>

<dt><b>Comments</b></dt><dd></dd>
</dl>
</div>
</nil>
</article>
<section id="postamble" class="status">
<p class="author">Author: Matt Price</p>
<p class="date">Created: 2021-05-06 Thu 13:51</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</section>
<script>window.klipse_settings = {selector_eval_html: '.src-html',
                             selector_eval_js: '.src-js',
                             selector_eval_python_client: '.src-python',
                             selector_eval_scheme: '.src-scheme',
                             selector: '.src-clojure',
                             selector_eval_ruby: '.src-ruby'};</script><script src="https://storage.googleapis.com/app.klipse.tech/plugin_prod/js/klipse_plugin.min.js"></script><link rel="stylesheet" type="text/css" href="https://storage.googleapis.com/app.klipse.tech/css/codemirror.css"/></body>
</html>
